In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('amazon_fires.csv')

In [3]:
df

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   object
 4   encontro  6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [5]:
df.describe()

               ano
count  6454.000000
mean   2007.461729
std       5.746654
min    1998.000000
25%    2002.000000
50%    2007.000000
75%    2012.000000
max    2017.000000

In [6]:
df["mes"]

0        Janeiro
1        Janeiro
2        Janeiro
3        Janeiro
4        Janeiro
          ...
6449    Dezembro
6450    Dezembro
6451    Dezembro
6452    Dezembro
6453    Dezembro
Name: mes, Length: 6454, dtype: object

In [7]:
df["numero"]=df["numero"].str.replace("Fires","")

In [8]:
df["numero"]

0        0
1        0
2        0
3        0
4        0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: numero, Length: 6454, dtype: object

In [9]:
df["numero"]=pd.to_numeric(df["numero"])

In [10]:
df["numero"]

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
        ...
6449    128.0
6450     85.0
6451    223.0
6452    373.0
6453    119.0
Name: numero, Length: 6454, dtype: float64

In [11]:
fire_count=df[df["mes"]=="Janeiro"]["numero"].sum()

In [12]:
print(fire_count)

47043.844

In [13]:
##sum() is used inside column and is done in individual column and is only done in numeric value
fired_2002=df[df["ano"]==2002]["numero"].sum()

In [14]:
print(fired_2002)

37841.21400000001

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ano       6454 non-null   int64
 1   mes       6454 non-null   object
 2   estado    6454 non-null   object
 3   numero    6322 non-null   float64
 4   encontro  6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [16]:
df

       ano       mes     estado  numero  encontro
0     1998   Janeiro       Acre     0.0  1/1/1998
1     1999   Janeiro       Acre     0.0  1/1/1999
2     2000   Janeiro       Acre     0.0  1/1/2000
3     2001   Janeiro       Acre     0.0  1/1/2001
4     2002   Janeiro       Acre     0.0  1/1/2002
...    ...       ...        ...     ...       ...
6449  2012  Dezembro  Tocantins   128.0  1/1/2012
6450  2013  Dezembro  Tocantins    85.0  1/1/2013
6451  2014  Dezembro  Tocantins   223.0  1/1/2014
6452  2015  Dezembro  Tocantins   373.0  1/1/2015
6453  2016  Dezembro  Tocantins   119.0  1/1/2016

[6454 rows x 5 columns]

In [17]:
loc_date_fire=df[(df["estado"]=="Tocantins") & (df["ano"]==2001)]["numero"].sum()

In [18]:
print(loc_date_fire)

2039.081

In [19]:
df

       ano       mes     estado  numero  encontro
0     1998   Janeiro       Acre     0.0  1/1/1998
1     1999   Janeiro       Acre     0.0  1/1/1999
2     2000   Janeiro       Acre     0.0  1/1/2000
3     2001   Janeiro       Acre     0.0  1/1/2001
4     2002   Janeiro       Acre     0.0  1/1/2002
...    ...       ...        ...     ...       ...
6449  2012  Dezembro  Tocantins   128.0  1/1/2012
6450  2013  Dezembro  Tocantins    85.0  1/1/2013
6451  2014  Dezembro  Tocantins   223.0  1/1/2014
6452  2015  Dezembro  Tocantins   373.0  1/1/2015
6453  2016  Dezembro  Tocantins   119.0  1/1/2016

[6454 rows x 5 columns]

In [20]:
t_df = pd.read_csv("https://raw.githubusercontent.com/Taj1920/Data-Analysis-Datasets/refs/heads/main/Datasets-Practice/titanic.csv")

In [21]:
t_df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [22]:
##df.shape[0,1]= df.shape[row,column]
##where rows =0 and columns=1
t_df[(t_df["survived"]==1) & (t_df["cabin"]=="B5")].shape[0]

2

In [23]:
t_df[(t_df["survived"]==1) & (t_df["cabin"]=="B5")].sum()

pclass                                                      2
name        Allen, Miss. Elisabeth WaltonMadill, Miss. Geo...
sex                                              femalefemale
age                                                      44.0
sibsp                                                       0
parch                                                       1
ticket                                             2416024160
fare                                                  422.675
cabin                                                    B5B5
embarked                                                   SS
survived                                                    2
dtype: object

In [24]:

t_df[(t_df["survived"]==1) & (t_df["cabin"]=="B5")].shape[1]

11

In [25]:

t_df[(t_df["survived"]==1) & (t_df["cabin"]=="B5")].shape

(2, 11)

In [26]:

t_df[(t_df["survived"]==1) & (t_df["cabin"]=="B5")].shape[0]

2

In [27]:
t_df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [28]:
t_df[(t_df["sex"]=="female") & (t_df["age"]<20) & (t_df["survived"]==1)].shape[0]

72

In [29]:
t_df[(t_df["embarked"]=="S") & (t_df["sex"]=="female")]["fare"].sum()

np.float64(11447.7378)

In [30]:
t_df[(t_df["pclass"]==3) & ((t_df["sibsp"]+t_df["parch"])==1)].shape[0]

79

In [31]:
t_df[t_df["embarked"]=="Q"]["fare"].max()

np.float64(90.0)

In [32]:
hr_df = pd.read_csv("https://raw.githubusercontent.com/Taj1920/Data-Analysis-Datasets/refs/heads/main/Datasets-Practice/hr_data.csv")

In [33]:
hr_df

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [34]:
support_spent=hr_df[(hr_df["promotion_last_5years"]==1) & (hr_df["department"]=="support")]["time_spend_company"].mean()

In [35]:
print(support_spent)

3.45

In [36]:
IT_project=hr_df[(hr_df["department"]=="IT") & (hr_df["salary"]=="high")]["number_project"].mean()

In [37]:
print(IT_project)

3.8674698795180724

In [38]:
support_num=hr_df[hr_df["department"]=="support"]["number_project"].sum()

In [39]:
print(support_num)

8479

In [40]:
hr_df[(hr_df["Work_accident"]==1) & (hr_df["department"]=="sales")].shape[0]

587

In [41]:
t_df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [42]:
t_df[t_df["embarked"]=="S"]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1295,3,"Windelov, Mr. Einar",male,21.0000,0,0,SOTON/OQ 3101317,7.2500,NaN,S,0
1296,3,"Wirz, Mr. Albert",male,27.0000,0,0,315154,8.6625,NaN,S,0
1297,3,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S,0
1298,3,"Wittevrongel, Mr. Camille",male,36.0000,0,0,345771,9.5000,NaN,S,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [43]:
t_df[t_df["fare"].between(20,40)]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
5,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.550,E12,S,1
14,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.000,A23,S,1
15,1,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.925,NaN,S,0
22,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C,1
25,1,"Birnbaum, Mr. Jakob",male,25.0,0,0,13905,26.000,NaN,C,0
...,...,...,...,...,...,...,...,...,...,...,...
1210,3,"Skoog, Mr. Wilhelm",male,40.0,1,4,347088,27.900,NaN,S,0
1211,3,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.900,NaN,S,0
1265,3,"Van Impe, Miss. Catharina",female,10.0,0,2,345773,24.150,NaN,S,0
1266,3,"Van Impe, Mr. Jean Baptiste",male,36.0,1,1,345773,24.150,NaN,S,0
1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.150,NaN,S,0

In [44]:
t_df[t_df['age'].isna()]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
15,1,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,0
37,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S,1
40,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,0
46,1,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,0
59,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,1
...,...,...,...,...,...,...,...,...,...,...,...
1293,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
1297,3,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S,0
1302,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,0
1303,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0

In [45]:
t_df[(t_df["survived"]==1) & (t_df["fare"]> t_df["fare"].median())]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
5,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,1
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,1
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,1
...,...,...,...,...,...,...,...,...,...,...,...
1189,3,"Sandstrom, Miss. Marguerite Rut",female,4.0000,1,1,PP 9549,16.7000,G6,S,1
1247,3,"Thorneycroft, Mrs. Percival (Florence Kate White)",female,NaN,1,0,376564,16.1000,NaN,S,1
1256,3,"Touma, Master. Georges Youssef",male,7.0000,1,1,2650,15.2458,NaN,C,1
1257,3,"Touma, Miss. Maria Youssef",female,9.0000,1,1,2650,15.2458,NaN,C,1
1258,3,"Touma, Mrs. Darwis (Hanne Youssef Razi)",female,29.0000,0,2,2650,15.2458,NaN,C,1

In [46]:
t_df[t_df["age"]<18]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
53,1,"Carrau, Mr. Jose Pedro",male,17.0000,0,0,113059,47.1000,NaN,S,0
54,1,"Carter, Master. William Thornton II",male,11.0000,1,2,113760,120.0000,B96 B98,S,1
55,1,"Carter, Miss. Lucile Polk",female,14.0000,1,2,113760,120.0000,B96 B98,S,1
...,...,...,...,...,...,...,...,...,...,...,...
1265,3,"Van Impe, Miss. Catharina",female,10.0000,0,2,345773,24.1500,NaN,S,0
1275,3,"Vander Planke, Mr. Leo Edmondus",male,16.0000,2,0,345764,18.0000,NaN,S,0
1279,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0000,0,0,350406,7.8542,NaN,S,0
1300,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,1,0,2659,14.4542,NaN,C,1
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0

In [47]:
t_df[(t_df["survived"]==1) & (t_df["sex"]=="female")]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,1
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,1
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,1
11,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,PC 17757,227.5250,C62 C64,C,1
12,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,PC 17477,69.3000,B35,C,1
...,...,...,...,...,...,...,...,...,...,...,...
1260,3,"Turja, Miss. Anna Sofia",female,18.0,0,0,4138,9.8417,NaN,S,1
1261,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,1
1286,3,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,1
1290,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
1300,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,1

In [48]:
t_df[(t_df["pclass"]=="1") | (t_df["pclass"]=="2")]

Empty DataFrame
Columns: [pclass, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, survived]
Index: []

In [49]:
t_df[(t_df["age"]<18) & (t_df["survived"]=="disaster")]

Empty DataFrame
Columns: [pclass, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, survived]
Index: []

In [50]:
t_df[(t_df["pclass"]==1)&(t_df["sex"]=="female")]

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,0
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,1
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,1
...,...,...,...,...,...,...,...,...,...,...,...
311,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S,1
314,1,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0,1,1,113503,211.5000,C80,C,1
315,1,"Willard, Miss. Constance",female,21.0,0,0,113795,26.5500,NaN,S,1
319,1,"Wilson, Miss. Helen Alice",female,31.0,0,0,16966,134.5000,E39 E41,C,1
322,1,"Young, Miss. Marie Grice",female,36.0,0,0,PC 17760,135.6333,C32,C,1